[
    {
      "riddle": "It walks on four legs in the morning, two legs at noon and three legs in the evening. What is it?",
      "answer": "man"
    },
    {
      "riddle": "I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. What am I?",
      "answer": "the letter e"
     
    },
    {
      "riddle": "What always runs but never walks, often murmurs, never talks, has a bed but never sleeps, has a mouth but never eats?",
      "answer": "a river"
    },
    {
      "riddle": "I never was, am always to be. No one ever saw me, nor ever will. And yet I am the confidence of all, To live and breathe on this terrestrial ball. What am I?",
      "answer": "the future"
    },
    {
      "riddle": "At night they come without being fetched. By day they are lost without being stolen. What are they?",
      "answer": "the stars"
    },
    {
      "riddle": "What is in seasons, seconds, centuries and minutes but not in decades, years or days?",
      "answer": "the letter n"
    },
    {
      "riddle": "The one who makes it, sells it. The one who buys it, never uses it. The one that uses it never knows that he’s using it. What is it?",
      "answer": "a coffin"
    },
    {
      "riddle": "The more you have of it, the less you see. What is it?",
      "answer": "Darkness"
    },
    {
      "riddle": "What smells like purple paint, tastes like green paint, and can appear as a white dove?",
      "answer": "white paint"
    },
      
{
	        "riddle" : "This thing all things devours: Birds, beasts, trees, flowers; Gnaws iron, bites steel; Grinds hard stones to meal; Slays king, ruins town, And beats high mountain down",
	        "answer" : "Time"
	    },
	     {
	        "riddle" : "What has roots as nobody sees, Is taller than trees Up, up it goes, And yet never grows?",
	        "answer" : "Mountain"
	    },
	     {
"riddle": "What word starts with 'e' and ends with 'e' but often has only one letter in it?",
 "answer": "Envelope"
},
{
"riddle": "My first's possessed by all mankind,My second skims the wave; My whole will dash through wave and wind. In hopes my first to save. Who am I?",
 "answer": "Lifeboat"
},
	    {
	        "riddle" : "Alive without breath, As cold as death; Never thirsty, ever drinking, All in mail never clinking",
	        "answer" : "Fish"
	    },
    {
      "riddle": "We are two brothers on opposite sides of the road, but we never see each other. Who are we?",
      "answer": "Eyes"
    },
    {
      "riddle": "This both describes gorgeous woman and an excellent punch.",
      "answer": " knockout"
    },
    {
      "riddle": "It's shorter than the rest, but when you're happy, you raise it up like it's the best. What is it?",
      "answer": "Thumb"
    },

    {
      "riddle": "I have a head, tail, but no arms and legs. What am I?",
      "answer": "Coin"
    },

    {
      "riddle": "My life is measured in hours. I serve by being devoured. Thin, I am quick; Fat, I am slow. Wind is my foe. What am I?",
      "answer": "Candles"
    },

    {
      "riddle": "There is one in every corner and two in every room.",
      "answer": "letter O"
    },

    {
      "riddle": "A man says: Brothers and sisters, have I none, but that man's father is my father's son. Who is he pointing at?",
      "answer": "Son"
    },

    {
      "riddle": "I weigh nothing, but you can still see me. If you put me in a bucket, I make the bucket lighter. What am I?",
      "answer": "A Hole"
    },

    {
      "riddle": " I have a neck, but no head, and I wear a cap. What am I?",
      "answer": "A Bottle"
    },

  {
"riddle": "You use a knife to slice my head, Then weep beside me when I’m dead. Who am I?",
 "answer": "An Onion"
},
{
      "riddle": "I get wet while drying. What am I?",
      "answer": "A Towel"
    },
{
      "riddle": "The more you take the more you leave behind.  What am I?",
      "answer": "Footsteps"
    },
{
      "riddle": "I eat, I live. I breathe, I live. I drink, I die. What am I?",
      "answer": "Fire"
    },
{
      "riddle": " I have a single eye but cannot see.  What am I?",
      "answer": " A needle"
    },
{
      "riddle": " I am a seed with three letters in my name. Take away the last two and I still sound the same. What am I?",
      "answer": " A pea"
    },

{
      "riddle": "I am tall when young and short when I am old. What am I?",
      "answer": "A candle"
    },
{
      "riddle": "I go up and never come down.  What am I?",
      "answer": "Age"
    },
{
"riddle": "Two horses, swiftest traveling, And harnessed in a pair, Grazing ever in places Distant from them. Who are we?",
 "answer": "The Eyes"
},
{
      "riddle": "I am black when you buy me, red when you use me and gray when you throw me away.  What am I?",
      "answer": "Charcoal"
    },
{
      "riddle": "I go in the water black and come out red.  What am I?",
      "answer": "Lobster"
    },
{
      "riddle": "I am heavy forward, but backward I’m not. What am I?",
      "answer": "Ton"
    },
{
      "riddle": "I disappear every time you say my name. What am I?",
      "answer": "Silence"
    },
{
      "riddle": "I fly without wings.  What am I?",
      "answer": "Time"
    },
{
      "riddle": "I have a face but no eyes, hands but no arms. What am I?",
      "answer": "A clock"
    },
{
      "riddle": "I am an instrument that you can hear but not touch or see.  What am I?",
      "answer": "Voice"
    },
{
      "riddle": "I The more you take away from me, the bigger I shall get. What am I?",
      "answer": "A hole"
    },
{
      "riddle": "If you have me, you want to share me. Once you share me, you won’t have me. What am I?",
      "answer": "A secret"
    },
{
      "riddle": "Tear me off and scratch my head, what once red is now black. What am I?",
      "answer": "A match"
    },
{
      "riddle": "I am full of holes but still holds water. What am I?",
      "answer": "A sponge"
    },
{
      "riddle": "I start with an E, end with an E, and have a letter in me. What am I?",	
      "answer": "Envelope"
    },
{
      "riddle": "I stink while living but smell good when dead. What am I?",
      "answer": "A pig"
    },
{
      "riddle": " I sit in a corner while traveling around the world. What am I?",
      "answer": " A stamp"
    },
{
      "riddle": "My rings are not worth much, but they ell my age. What am I?",
      "answer": " A tree"
    },
{
      "riddle": " If you lose me you may cause people around me to lose me too. What am I?",
      "answer": " Your temper"
    },
{
      "riddle": " I am constantly overlooked by everyone but everyone has me. What am I?",
      "answer": " A nose"
    },
{
      "riddle": "I belong to you but others use me more often than you do. What am I?",
      "answer": "Your name"
    },
{
      "riddle": "I must be broken before you can use me. What am I?",
      "answer": "An egg"
    },
{
      "riddle": "I cannot be burned by fire or drowned in water. What am I?",
      "answer": "Ice"
    },
{
      "riddle": "I can fall off a building and live, but put me in water I will die. What am I?",
      "answer": "Paper"
    },
{
      "riddle": "The faster you run, the harder it is to catch me. What am I ??",
      "answer": "Breath"
    },
{
      "riddle": "What can point in every direction but can't reach the destination by itself.",
      "answer": "Your finger"
    },
{
      "riddle": "What goes up when the rain comes down?",
      "answer": "An umbrella"
    },
{
      "riddle": "What do you call two witches who live together?",
      "answer": "Broommates"
    },
{
      "riddle": "There are two monkeys on a tree and one jumps off.  Why does the other monkey jump too?",
      "answer": "Monkey see monkey do"
    },
{
      "riddle": "I'm not clothes but I cover your body;The more I'm used, the thinner I grow.What am I?",
      "answer": "Bar of Soap"
    },
{
"riddle": "A wee, wee man, in a red, red coat, A staff in his hand, and a bone in his throat. Who am I?",
 "answer": " A Cherry"
},
{
      "riddle": "What is the worst vegetable to have on a ship?",
      "answer": "A leek(leak)"
    },
{
      "riddle": "Flat as a leaf, round as a ring; Has two eyes, can't see a thing.What is it?",
      "answer": "A button"
    },
{
      "riddle": "Why was the picture sent to jail?",
      "answer": "Because it was framed"
    },
{
      "riddle": "Never resting, never still. Moving silently from hill to hill. It does not walk, run or trot, All is cool where it is not. What is it?",
      "answer": "Sunshine"
    },
{
      "riddle": "It has a long neck, A name of a bird, Feeds on cargo of ships, It's not alive,What is it?",
      "answer": "A crane"
    },
{
      "riddle": "What hired killer never goes to jail?",
      "answer": "An exterminator"
    },
{
"riddle": "David’s mother had three children. The first child was named April; the second child was named May. What was the third child’s name?",
 "answer": "David"
},
{
      "riddle": "What falls down but never breaks?",
      "answer": "Nightfall"
    },
{
      "riddle": " I love to dance and twist and prance, I shake my tail, as away I sail, wingless I fly into the sky.What am I?",
      "answer": " A Kite"
    },
{
      "riddle": "What makes a pair of shoes?",
      "answer": "Two shoes"
    },
{
      "riddle": "A farmer has 17 sheep and all but 9 die. How many are left alive?",
      "answer": "9"
    },
{
      "riddle": " Two teams were playing soccer against each other. One player from Team One scored a hat trick (triple goal). Their teammates were very happy. But when he scored the fourth goal,their teammates scolded him instead. How could this be possible? ",
      "answer": " The player scored an own goal"
    },
{
      "riddle": " What did the scientist get when he crossed a chicken and a cow? ",   
  "answer": " Roost beef"
    },
{
"riddle": "A farmer had twelve prize cows. He arose one morning to find that all but nine of them had been stolen by cattle thieves. How many did he have left?",
 "answer": "Nine"
},
{
"riddle": "If you are running a race, and you overtake the person in second place, what place do you move into?",
 "answer": "Second"
},
{
"riddle": "At two letters I am a male, at three I’m the converse. Four letters and I’m male again but greater than of late, At my full length my gender’s changed, but I’m equally as great.",
 "answer": " Heroine"
},
{
      "riddle": " My family is known to be crazy;I am good when I am alone and when spread I am amazing;It's a matter of taste;I am good for your health, bad for your waist.What am I?",
      "answer": "Peanut"
    },
{
      "riddle": "A very pretty thing am I, fluttering in the pale-blue sky. Delicate, fragile on the wing, indeed I am a pretty thing. What am I?",
      "answer": "Butterfly"
    },
{
      "riddle": "Through me you see through things. What am I?",
      "answer": "X-ray Machine"
    },
    {
"riddle": "My fleece is white as snow. Everywhere that Mary goes, I go. What am I?",
      "answer": "Lamb"
    },
{
"riddle": "Which of the witch's friends eats the fastest?",
      "answer": "Goblin"
    },

{"riddle": "Who is next to a king on his throne?",
      "answer": "Queen"
    },
{
"riddle": "What is bought by the yard and worn by the foot?",
      "answer": "Carpet"
    },
{
"riddle": "Not born, but from a Mother's body drawn, I hang until half of me is gone. I sleep in a cave until I grow old, then valued for my hardened gold. What am I?",
      "answer": "Cheese"
    },
{
"riddle": "What can go up a chimney down, but cannot go down a chimney up? ",
     "answer": "Umbrella"
    },
{
"riddle": "Black I am and much admired, men seek me until they're tired. When they find me, they break my head, and take from me my resting bed. What am I?",
      "answer": "Coal"
    },
{
"riddle": "What do angels sing in the shower?",
      "answer": "Soul"
    },
{
"riddle": "little Nancy Ettistoat, in a white pettiecoat and a red nose, the longer she stands, the shorter she grows!",
      "answer": "Candle"
    },
{
"riddle": "I go up and down the stairs without moving.What am I?",
      "answer": "Carpet"
    },
    {
"riddle": "If a stopper and a bottle cost $2.10 and the bottle costs $2.00 more than the stopper.Then what does the stopper cost?",
      "answer": "Five Cents"
    },
{
"riddle": "Blend a teapot shot so the pearlies won't rot!",
      "answer": "Toothpaste"
    },
    {
"riddle": "Runs over fields and woods all day Under the bed at night sits not alone, With long tongue hanging out, Awaiting for a bone. What am I?",
      "answer": "Shoe"
    },
    {
"riddle": "Tara has $29.00 dollars. She bought 4 coloring books that cost $3.00 each, 4 boxes of crayola crayons that cost $2.00 each. She spend the rest of her money on markers.How much money did she spend on markers",
      "answer": "$9.00"
    },
    {
"riddle": " The letters of the alphabet but only just a few;It's hard to say if I was invented or just discovered by you.What am I?",
      "answer": "Music"
    },
    {
"riddle": "My tines be long,My tines be short,My tines end ere,My first report.,What am I?",
      "answer": "Lightning"
    },
    {
"riddle": "When is a door not a door?",
      "answer": "When it’s a-jar"
    },
    {
"riddle": "I'm sometimes white, Although sometimes I'm black. I take you there, But never bring you back.What am I?",
      "answer": "Hearse"
    },
    {
"riddle": "A nonstop train leaves Moscow for Leningrad at 60 mph. Another nonstop train leaves leningrad for Moscow at 40 mph. How far apartare the trains 1 hour before they pass eachother?",
      "answer": "100 miles"
    },
    {
"riddle": "Place three matches on a table. Tell a friend to add two more matches to make eight.",
      "answer": "VIII"
    },
    {
"riddle": "Three matches are sitting on a table. Without adding another make for three matches four. You are not allowed to break any of the matches.",
      "answer": "IV"
    },
    {
"riddle": "I come across as flat,But theirs more to me than my surface;You climb my moutains from top to bottom,And fall from bottom to top.What am I?",
      "answer": "An Ocean"
    },
    {
"riddle": "What is the time-piece, That needs no winding?",
      "answer": "A Rooster"
    },
    {
"riddle": "What do you use to hoe a row, slay a foe, and wring with woe?",
      "answer": "Hands"
    },
    {
"riddle": "What is the only common four-letter English word that ends in the suffix -eny?",
      "answer": "Deny"
    },
    {
"riddle": "At the sound of me, men may dream or stomp their feet at the sound of me, women may laugh or sometimes weep. What am I?",
      "answer": "Music"
    },
    {
"riddle": "When they are caught, they are thrown away. When they escape, you itch all day. What are they?",
      "answer": "Fleas"
    },
    {
"riddle": "I have four of these, With matching extremities. They can do many things, And hardly ever bring me pain. Unless I stick them with a pin, Or burn them sometimes when... What is it that I can wiggle at will? And use in other means still?",   
 "answer": "Fingers"
    },
    {
"riddle": "A room with no windows or doors Walks in the night, grows in a day, Is found where there is death and decay.",
      "answer": "Mushroom"
    },
    {
"riddle": "Long and slinky like a trout, never sings till its guts come out.  What is it?",
      "answer": "Gun"
    },
    {
"riddle": "What are the next three letters in this sequence? O T T F F S S",
 "answer": " E, N, T."
},
{
"riddle": "Five creatures cross a field of snow; But leave a single track behind Whose loops and bows are soon, I know, Unravelled by the mind",
 "answer": "A Scribe’s Hand "
},
{
"riddle": "She wears a blue ring, She wears a grey cloak. She cannot sing her suffering — Her tongue is made of oak",
 "answer": "A Castle "
},
{
"riddle": "It’s clear these three are brothers For they share a single face. But tell me why they chase each-other Round and round their dwelling place",
 "answer": " A Ring "
},
{
"riddle": "Tonight at the ball I dance, I dance As well as any you see. Yet nobody takes me by the hand, Or says a word to me.",
 "answer": "A Shadow "
},
{
"riddle": "You are not envious of her, Or so I’m sure you’d say, But tell me why you always wear What she wore yesterday? Who is the mysterious woman?",
 "answer": " A Coat Hanger "
},
{
"riddle": "Evening’s softest blanket’s here And brilliantly white. And yet I pray to God I’m not Enwrapped in it tonight!",
 "answer": " Fresh Snowfall "
},
{
"riddle": "When you walk on the living, there’s scarcely a whisper; But walk on the dead, and the crunch is much crisper! The bones you have broken, are strewn in the street, — What lies beneath your feet?",
 "answer": " Fallen Leaves "
},
{
"riddle": "Decipher what each initial stands for. 24 H in a D ",
 "answer": "24 hours in a day"
},
{
"riddle": "Decipher what each initial stands for.  2 Q in a C",
 "answer": "2 Quavers in a Crotchet"
},
{
"riddle": "Decipher what each initial stands for.  7 E in the H",
 "answer": "7 Events in the Heptathlon"
},
{
"riddle": "Decipher what each initial stands for.  1 H in a D",
 "answer": "1 Hole in a Doughnut"
},
{
"riddle": "Decipher what each initial stands for. 16 O in a P ",
 "answer": " 16 Ounces in a Pound"
},
{
"riddle": "Decipher what each initial stands for.  2 W in a F",
 "answer": " 2 Weeks in a Fortnight"
},
{
"riddle": "What has roots as nobody sees, Is taller than trees, Up, up it goes, And yet never grows?",
 "answer": " A Mountain"
},
{
"riddle": "Thirty white horses on a red hill, First they champ, Then they stamp, Then they stand still.",
 "answer": "Teeth"
}
    ]





      

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
